Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Baseline 100 User Load Test"
    - duration: 30
      arrivalRate: 200
      name: "Stress Load Test"
  defaults:
    headers:
      User-Agent: "Artillery-Load-Tester/1.0"

scenarios:
  - name: "API Performance Flow"
    flow:
      - get:
          url: "/doctors?lat=13.0827&lon=80.2707"
      - get:
          url: "/help"
      - get:
          url: "/privacy"
